
# Python 基本类型的转换
"""
使用 input() 函数获取键盘输入（字符串）
使用 int() 函数效输入的字符串换成整数
使用 print() 函数输出带有占位符的字符串
"""
a = int(input("a = "))
b = int(input("b = "))
# %d 表示整数占位符，%f 表示小数
print('%d + %d = %d' % (a, b, a + b))
print('%d - %d = %d' % (a, b, a - b))
print('%d * %d = %d' % (a, b, a * b))
print('%d / %d = %d' % (a, b, a / b))
# // 表示整除
print('%d // %d = %d' % (a, b, a // b))
# %表示占位符，要表示 “%”时，要使用 %%
print('%d %% %d = %d' % (a, b, a % b))
# ** 表示指数
print('%d ** %d = %d' % (a, b, a ** b))

"""
a = 20
b = 2
20 + 2 = 22
20 - 2 = 18
20 * 2 = 40
20 / 2 = 10
20 // 2 = 10
20 % 2 = 0
20 ** 2 = 400
"""
